sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
//uint8_t flash_IgEvent[NUM_total] = {SPI_FLASH_PROGRAM_PAGE, SPI_FLASH_ADD_Byte0, SPI_FLASH_ADD_Byte1, SPI_FLASH_ADD_Byte2,
		SPI_FLASH_DATA_TAG, 0, 1, IG_Recovery, 4, 1,
		60, 10, 4, 60, 2, 30, 5, FALSE, 5, 12,
		9, 54, 0, 50,	100, 50, 0, 0, 0, 0,
		0, 0, 0, 0,	0, 0, 0, 0, 0, 0,
		0, 10, 10, 0, 9, 36, 0, 0, 0, 0,
		0, 0, 0x03, 0x03, 0x03, 0x03};

*/

/* power adapter (option)
//less
uint8_t flash_IgEvent[NUM_total] = {SPI_FLASH_PROGRAM_PAGE, SPI_FLASH_ADD_Byte0, SPI_FLASH_ADD_Byte1, SPI_FLASH_ADD_Byte2,
		SPI_FLASH_DATA_TAG, 0, 1, 4, 1, 60,
		10, 4, 90, 2, 30, 5, 5, 12,	20, 145,
		0, 50, 100, 50, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 9, 36,
		0, 0, 0, 0, 0, 0, 0x03, 0x03, 0x03, 0x03};    // RTC_WakeT_min


//uint8_t flash_IgEvent[NUM_total] = {SPI_FLASH_PROGRAM_PAGE, SPI_FLASH_ADD_Byte0, SPI_FLASH_ADD_Byte1, SPI_FLASH_ADD_Byte2,
		SPI_FLASH_DATA_TAG, 0, 1, IG_Recovery, 4, 1,
		60, 10, 4, 90, 2, 30, 5, FALSE, 5, 12,
		20, 145, 0, 50,	100, 50, 0, 0, 0, 0,
		0, 0, 0, 0,	0, 0, 0, 0, 0, 0,
		0, 10, 10, 0, 9, 36, 0, 0, 0, 0,
		0, 0, 0x03, 0x03, 0x03, 0x03};
*/

uint8_t flag_flashWrite = 0;

volatile sIG_EVENT ig_event;

/** @defgroup STM32F0XX_RTC STM32F0XX RTC time, date and alarm.
  * @{
  */
RTC_TimeTypeDef  sTime = {0};
RTC_DateTypeDef  sDate = {0};
RTC_AlarmTypeDef sAlarm = {0};

DMA_HandleTypeDef hdma_usart1_rx;
DMA_HandleTypeDef hdma_usart1_tx;

//eeprom(flash)
/*Variable used for Erase procedure*/
static FLASH_EraseInitTypeDef EraseInitStruct;

uint32_t PageError = 0;
uint32_t eeprom_test[EEPROM_DATA_LEN] = {EEPROM_TAG, 0x01020304, 0x02040608, 0x10203040, 0x20406080, 0x12345678};
//uint32_t eeprom_test[EEPROM_DATA_LEN] = {EEPROM_TAG, 0x11111111, 0x22222222, 0x33333333, 0x44444444, 0x55555555};

/* USER CODE END Variables */

/* Function prototypes -------------------------------------------------------*/
void StartDefaultTask(void const * argument);
void usart1_entry(void const * argument);
void usart2_entry(void const * argument);
void usart3_entry(void const * argument);
void ignition_entry(void const * argument);
void i2c1_entry(void const * argument);
void adc_entry(void const * argument);
void IWDG_entry(void const * argument);
void cmd_proc_entry(void const * argument);
void gpio_state_entry(void const * argument);
void spi1_entry(void const * argument);
void can_entry(void const * argument);

void MX_FREERTOS_Init(void); /* (MISRA C 2004 rule 8.1) */

/* USER CODE BEGIN FunctionPrototypes */
#if (AEWIN_DBUG)
void aewin_dbg(char *fmt,...);
uint8_t adc_voltageConversion_int(uint32_t adc_value);
uint8_t adc_voltageConversion_float(uint32_t adc_value);
uint8_t adc_tempConversion_int(uint32_t adc_value);
uint8_t adc_tempConversion_float(uint32_t adc_value);
uint8_t uart2_isFindString(uint8_t uart_msg[], uint8_t target_string[], uint8_t length);
void enable_4GModule(void);
uint8_t uart_findDataIndex(uint8_t uart_msg[], uint8_t target_data);
void print_atCommand(uint8_t rx_msg[], uint8_t onOff);
uint8_t check_lowPower(uint32_t adc_value);
uint8_t check_highPower(uint32_t adc_value);
void config_recovery(void);
#endif


/* USER CODE END FunctionPrototypes */

/* Hook prototypes */

/* Init FreeRTOS */

void MX_FREERTOS_Init(void) {
  /* USER CODE BEGIN Init */
	uint32_t Address = 0;
	uint8_t data_counter = 0;

	//HAL_UART_Transmit(&huart3, SVA_1000_NL, sizeof(SVA_1000_NL) - 1, sizeof(SVA_1000_NL));
	HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
	HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN);

	HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_SET);

	//read flash

	//current_IgEvent load data from flash_IgEvent
	config_recovery();


	//countdown_timer initialize
	countdown_timer.poweron_delay    = current_IgEvent[NUM_pwron_delay];
	countdown_timer.startup_timeout  = current_IgEvent[NUM_startup_timeout];
	countdown_timer.shutdown_delay   = current_IgEvent[NUM_shutdown_delay];
	countdown_timer.shutdown_timeout = current_IgEvent[NUM_shutdown_timeout];
	countdown_timer.poweroff_delay   = current_IgEvent[NUM_pwroff_delay];


	enable_4GModule();

	//--------------------
	//read EEPROM
	/* Check the correctness of written data */
	Address = FLASH_USER_START_ADDR;

	if((*(__IO uint32_t*) Address) != EEPROM_TAG)
	{
		/* Flash page erase */
		EraseInitStruct.TypeErase   = FLASH_TYPEERASE_PAGES;
		EraseInitStruct.PageAddress = FLASH_USER_START_ADDR;
		EraseInitStruct.NbPages     = (FLASH_USER_END_ADDR - FLASH_USER_START_ADDR)/FLASH_PAGE_SIZE;

		if (HAL_FLASHEx_Erase(&EraseInitStruct, &PageError) != HAL_OK)
		{
		  /*
			Error occurred while page erase.
			User can add here some code to deal with this error.
			PageError will contain the faulty page and then to know the code error on this page,
			user can call function 'HAL_FLASH_GetError()'
		  */
		}

		/*Flash write initial data */
		for(data_counter = 0; data_counter < EEPROM_DATA_LEN ; data_counter++)
		{
			if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, Address + data_counter*4, eeprom_test[data_counter]) != HAL_OK)
			{
			/* Error occurred while writing data in Flash memory.
			   User can add here some code to deal with this error */
			}
		}
	}
	else
	{
		/* Flash read data */
		for(data_counter = 0; data_counter < EEPROM_DATA_LEN ; data_counter++)
		{
			eeprom_test[data_counter] = (*(__IO uint32_t*) (Address + data_counter*4));
		}
	}



  /* USER CODE END Init */

  /* Create the mutex(es) */
  /* definition and creation of MUTEX_Debug */
  osMutexDef(MUTEX_Debug);
  MUTEX_DebugHandle = osMutexCreate(osMutex(MUTEX_Debug));

  /* definition and creation of MUTEX_ADC_Q */
  osMutexDef(MUTEX_ADC_Q);
  MUTEX_ADC_QHandle = osMutexCreate(osMutex(MUTEX_ADC_Q));

  /* definition and creation of MUTEX_CMD_PROC */
  osMutexDef(MUTEX_CMD_PROC);
  MUTEX_CMD_PROCHandle = osMutexCreate(osMutex(MUTEX_CMD_PROC));

  /* definition and creation of MUTEX_SPI1 */
  osMutexDef(MUTEX_SPI1);
  MUTEX_SPI1Handle = osMutexCreate(osMutex(MUTEX_SPI1));

  /* USER CODE BEGIN RTOS_MUTEX */
	/* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
	/* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
	/* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* Create the thread(s) */
  /* definition and creation of defaultTask */
  osThreadDef(defaultTask, StartDefaultTask, osPriorityIdle, 0, 128);
  defaultTaskHandle = osThreadCreate(osThread(defaultTask), NULL);

  /* definition and creation of USART1_Task */
  osThreadDef(USART1_Task, usart1_entry, osPriorityHigh, 0, 256);
  USART1_TaskHandle = osThreadCreate(osThread(USART1_Task), NULL);

  /* definition and creation of USART2_Task */
  osThreadDef(USART2_Task, usart2_entry, osPriorityNormal, 0, 256);
  USART2_TaskHandle = osThreadCreate(osThread(USART2_Task), NULL);

