sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
    	  /*##-3- Put UART peripheral in reception process ###########################*/
    	  if(HAL_UART_Receive(&huart2, (uint8_t *)recv2, 10, 5000) != HAL_OK)
    	  {
    	    Error_Handler();
    	  }



    	  if(HAL_UART_Receive_IT(&huart2, (uint8_t*)&recv2, 10)!= HAL_OK)
    	{
    		Error_Handler();
    	}

    	while (UartReady != SET)
		  {
		  }
#endif


    	if(wwan_command == 1)
    	{
    		// enable WWAN, normal mode
    		wwan_command = 0;

    		// Normal mode
			HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Dis_airplane], sizeof(uart_Tx[ATCMD_Dis_airplane])-1, 30);
			HAL_UART_Transmit(&huart2, "\r", 1, 30);

			if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
			{
				//Error_Handler();
			}
			osDelay(UART2_ATCMD_DELAY);
			HAL_UART_Abort_IT(&huart2);

			print_atCommand(recv2, uart2_msg_print_switch);
			memset(recv2, 0, UART2_RX_LENGTH);
    	}
    	else if(wwan_command == 2)
    	{
    		// disable WWAN, airplane mode
    		wwan_command = 0;

    		// Airplane mode
			HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_En_airplane], sizeof(uart_Tx[ATCMD_En_airplane])-1, 30);
			HAL_UART_Transmit(&huart2, "\r", 1, 30);

			if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
			{
				//Error_Handler();
			}
			osDelay(UART2_ATCMD_DELAY);
			HAL_UART_Abort_IT(&huart2);

			print_atCommand(recv2, uart2_msg_print_switch);
			memset(recv2, 0, UART2_RX_LENGTH);
    	}
    	//----------------------------------------


    	// Get the NMEA $RMC messages
		HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Get_GPS_DATA], sizeof(uart_Tx[ATCMD_Get_GPS_DATA])-1, 30);
		HAL_UART_Transmit(&huart2, "\r", 1, 30);

		if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
		{
			//Error_Handler();
		}
		else
		{
			print_atCommand(recv2, uart2_msg_print_switch);

			if(uart2_isFindString(recv2, string_Not, 3) == 1)
			{
				// Enable GPS AT+UGPS=1
				HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Enable_GPS], sizeof(uart_Tx[ATCMD_Enable_GPS])-1, 30);
				HAL_UART_Transmit(&huart2, "\r", 1, 30);

				if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
				{
					//Error_Handler();
				}
				osDelay(UART2_ATCMD_DELAY);
				HAL_UART_Abort_IT(&huart2);

				print_atCommand(recv2, uart2_msg_print_switch);
				memset(recv2, 0, UART2_RX_LENGTH);

				osDelay(UART2_ATCMD_DELAY*2);
			}
			else
			{
				// find data index
				// find index of latitude and longitude
				/*
				split_count = 0;
				for(i = 0; i<UART2_RX_LENGTH; i++)
				{
					if(recv2[i] == ',')
					{
						split_count++;
					}

					if(split_count == 4)
					{
						latitude_index = i+1;
					}

					if(split_count == 6)
					{
						longitude_index = i+1;
						break;
					}
				}
				*/

				latitude_index = uart_findDataIndex(recv2,5);
				longitude_index = uart_findDataIndex(recv2,7);

				// Get latitude and longitude data
				latitude = 0;   //24
				longitude = 0;  //121
				if((recv2[latitude_index] != ',') && (latitude_index != longitude_index))
				{
					// latitude
					for( i = 0; i < 10; i++)
					{
						if(recv2[latitude_index+i] != '.')
						{
							if(recv2[latitude_index+i] == ',')
							{
								break;
							}
							latitude = 10*latitude + (recv2[latitude_index+i]-'0');
						}
					}

					// longitude
					for( i = 0; i < 11; i++)
					{
						if(recv2[longitude_index+i] != '.')
						{
							if(recv2[longitude_index+i] == ',')
							{
								break;
							}
							longitude = 10*longitude + (recv2[longitude_index+i]-'0');
						}
					}
				}

				//aewin_dbg("\n\rlatitude  index is: %d, value is %u. \r\n", latitude_index, latitude);
				//aewin_dbg("\n\rlongitude index is: %d, value is %u. \r\n", longitude_index, longitude);

				// send data to queue
				if( osMessagePut(UART2_LAT_QHandle, latitude, UART2_TIMEOUT) != osOK )
				{
					//aewin_dbg("\n\rUART2 GPS latitude put Q failed. \r\n");
				}

				if( osMessagePut(UART2_LONG_QHandle, longitude, UART2_TIMEOUT) != osOK )
				{
					//aewin_dbg("\n\rUART2 GPS longitude put Q failed. \r\n");
				}
			}
		}
		osDelay(UART2_ATCMD_DELAY);
		HAL_UART_Abort_IT(&huart2);
		memset(recv2, 0, UART2_RX_LENGTH);
		//----------------------------------------


		// Airplane mode or normal mode AT+CFUN?
		HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Get_airplane], sizeof(uart_Tx[ATCMD_Get_airplane])-1, 30);
		HAL_UART_Transmit(&huart2, "\r", 1, 30);

		if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
		{
			//Error_Handler();
		}
		osDelay(UART2_ATCMD_DELAY);
		HAL_UART_Abort_IT(&huart2);

		if(recv2[uart_findDataIndex(recv2,1)] == '4')
		{
			r280_module_state.normal_flight_states = 40;
		}
		else //0,1,19
		{
			r280_module_state.normal_flight_states = 10;
		}

		//aewin_dbg("SIM mode is %d (airplane mode is '4')\r\n",  (recv2[uart_findDataIndex(recv2,1)]-'0'));
		print_atCommand(recv2, uart2_msg_print_switch);
		memset(recv2, 0, UART2_RX_LENGTH);
		//----------------------------------------


		// Get 3G,4G status AT+COPS?
		HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Check_Reg], sizeof(uart_Tx[ATCMD_Check_Reg])-1, 30);
		HAL_UART_Transmit(&huart2, "\r", 1, 30);

		if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
		  {
			//Error_Handler();
		  }
		osDelay(UART2_ATCMD_DELAY*3);
		HAL_UART_Abort_IT(&huart2);

		reg_index = uart_findDataIndex(recv2,4);

		if(recv2[reg_index] == '7')                  //4G
		{
			r280_module_state.register_3G_4G = 7;
		}
		else if(recv2[reg_index] == '2')             //3G
		{
			r280_module_state.register_3G_4G = 2;
		}
		else if(recv2[reg_index] == '0')             //2G
		{
			r280_module_state.register_3G_4G = 0;
		}

		print_atCommand(recv2, uart2_msg_print_switch);
		memset(recv2, 0, UART2_RX_LENGTH);
		//----------------------------------------


		// 4G signal strength AT+CSQ
		HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Check_Signal], sizeof(uart_Tx[ATCMD_Check_Signal])-1, 30);
		HAL_UART_Transmit(&huart2, "\r", 1, 30);

		if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
		{
			//Error_Handler();
		}
		osDelay(UART2_ATCMD_DELAY);
		HAL_UART_Abort_IT(&huart2);

		r280_module_state.signal_strength = 0;
		strength_index = uart_findDataIndex(recv2, 1);

		if(strength_index != 0)
		{
			r280_module_state.signal_strength = (recv2[strength_index]-'0');
			if (recv2[strength_index+1] != ',')
			{
				r280_module_state.signal_strength = 10*r280_module_state.signal_strength + (recv2[strength_index+1]-'0');
			}
		}

		//aewin_dbg("signal_sterngth is %d\r\n", r280_module_state.signal_strength);
		print_atCommand(recv2, uart2_msg_print_switch);
		memset(recv2, 0, UART2_RX_LENGTH);
		//----------------------------------------


		// 4G IP Addresss at+cgdcont?
		HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Check_APNIP], sizeof(uart_Tx[ATCMD_Check_APNIP])-1, 30);
		HAL_UART_Transmit(&huart2, "\r", 1, 30);

		if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
		{
			//Error_Handler();
		}
		osDelay(UART2_ATCMD_DELAY);
		HAL_UART_Abort_IT(&huart2);

