sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
		ip_index = uart_findDataIndex(recv2,4)+1;

		ip_counter = 0;
		r280_module_state.ip_add_0 = 0;
		r280_module_state.ip_add_1 = 0;
		r280_module_state.ip_add_2 = 0;
		r280_module_state.ip_add_3 = 0;

		for( i = ip_index ; i < uart_findDataIndex(recv2,5)-2 ; i++ )
		{
			if(recv2[i]!='.')
			{
				switch(ip_counter)
				{
					case 0:
						r280_module_state.ip_add_0 = r280_module_state.ip_add_0*10 + (recv2[i]-'0');
						break;

					case 1:
						r280_module_state.ip_add_1 = r280_module_state.ip_add_1*10 + (recv2[i]-'0');
						break;

					case 2:
						r280_module_state.ip_add_2 = r280_module_state.ip_add_2*10 + (recv2[i]-'0');
						break;

					case 3:
						r280_module_state.ip_add_3 = r280_module_state.ip_add_3*10 + (recv2[i]-'0');
						break;

					default:
						break;
				}

			}
			else
			{
				ip_counter++;
			}
		}

		//aewin_dbg("IP is %x.%x.%x.%x\r\n",  r280_module_state.ip_add_0, r280_module_state.ip_add_1, r280_module_state.ip_add_2, r280_module_state.ip_add_3);
		print_atCommand(recv2, uart2_msg_print_switch);
		memset(recv2, 0, UART2_RX_LENGTH);
		//----------------------------------------


		// ping status AT+UPING="www.google.com"
		HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Ping_web], sizeof(uart_Tx[ATCMD_Ping_web])-1, 30);
		HAL_UART_Transmit(&huart2, "\r", 1, 30);

		if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
		  {
			//Error_Handler();
		  }
		osDelay(UART2_ATCMD_DELAY*5);
		HAL_UART_Abort_IT(&huart2);

		print_atCommand(recv2, uart2_msg_print_switch);


		// check ping status
		if((uart2_isFindString(recv2, string_UUPING, sizeof(string_UUPING)) == 1) && (uart2_isFindString(recv2, string_UUPINGER, sizeof(string_UUPINGER)) == 0))
		{
			r280_module_state.ping_status = 0; //OK
			memset(recv2, 0, UART2_RX_LENGTH);
		}
		else
		{
			r280_module_state.ping_status = 1; //ERROR
			memset(recv2, 0, UART2_RX_LENGTH);

			//reset APN and PSD

			// set APN provider AT+UPSD=0,1,"apn.name"
			HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Set_APN], sizeof(uart_Tx[ATCMD_Set_APN])-1, 30);
			HAL_UART_Transmit(&huart2, "\r", 1, 30);

			if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
			{
				//Error_Handler();
			}
			osDelay(UART2_ATCMD_DELAY);
			HAL_UART_Abort_IT(&huart2);

			print_atCommand(recv2, uart2_msg_print_switch);
			memset(recv2, 0, UART2_RX_LENGTH);

			// reset PSD AT+UPSDA=0,0
			HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Reset_PSD], sizeof(uart_Tx[ATCMD_Reset_PSD])-1, 30);
			HAL_UART_Transmit(&huart2, "\r", 1, 30);

			if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
			{
				//Error_Handler();
			}
			osDelay(UART2_ATCMD_DELAY*2);
			HAL_UART_Abort_IT(&huart2);

			print_atCommand(recv2, uart2_msg_print_switch);
			memset(recv2, 0, UART2_RX_LENGTH);

			// activate PSD AT+UPSDA=0,3
			HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Enable_PSD], sizeof(uart_Tx[ATCMD_Enable_PSD])-1, 30);
			HAL_UART_Transmit(&huart2, "\r", 1, 30);

			if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
			{
				//Error_Handler();
			}
			osDelay(UART2_ATCMD_DELAY*2);
			HAL_UART_Abort_IT(&huart2);

			print_atCommand(recv2, uart2_msg_print_switch);
			memset(recv2, 0, UART2_RX_LENGTH);

			// ublox FAE ======================================================
			HAL_UART_Transmit(&huart2, "AT+COPS=2", sizeof("AT+COPS=2")-1, 30);
			HAL_UART_Transmit(&huart2, "\r", 1, 30);

			if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
			{
				//Error_Handler();
			}
			osDelay(UART2_ATCMD_DELAY);
			HAL_UART_Abort_IT(&huart2);

			print_atCommand(recv2, uart2_msg_print_switch);
			memset(recv2, 0, UART2_RX_LENGTH);
			//----------------------------------------

			HAL_UART_Transmit(&huart2, "at+cgdcont=4,\"ip\",\"internet\"", sizeof("at+cgdcont=4,\"ip\",\"internet\"")-1, 30);
			HAL_UART_Transmit(&huart2, "\r", 1, 30);

			if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
			{
				//Error_Handler();
			}
			osDelay(UART2_ATCMD_DELAY);
			HAL_UART_Abort_IT(&huart2);

			print_atCommand(recv2, uart2_msg_print_switch);
			memset(recv2, 0, UART2_RX_LENGTH);
			//----------------------------------------


			HAL_UART_Transmit(&huart2, "AT+COPS=0", sizeof("AT+COPS=0")-1, 30);
			HAL_UART_Transmit(&huart2, "\r", 1, 30);

			if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
			{
				//Error_Handler();
			}
			osDelay(UART2_ATCMD_DELAY);
			HAL_UART_Abort_IT(&huart2);

			print_atCommand(recv2, uart2_msg_print_switch);
			memset(recv2, 0, UART2_RX_LENGTH);
			//----------------------------------------


			HAL_UART_Transmit(&huart2, "AT+CGACT=1,4", sizeof("AT+CGACT=1,4")-1, 30);
			HAL_UART_Transmit(&huart2, "\r", 1, 30);

			if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
			{
				//Error_Handler();
			}
			osDelay(UART2_ATCMD_DELAY);
			HAL_UART_Abort_IT(&huart2);

			print_atCommand(recv2, uart2_msg_print_switch);
			memset(recv2, 0, UART2_RX_LENGTH);
			//----------------------------------------

			HAL_UART_Transmit(&huart2, "at+upsd=0,100,4", sizeof("at+upsd=0,100,4")-1, 30);
			HAL_UART_Transmit(&huart2, "\r", 1, 30);

			if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
			{
				//Error_Handler();
			}
			osDelay(UART2_ATCMD_DELAY);
			HAL_UART_Abort_IT(&huart2);

			print_atCommand(recv2, uart2_msg_print_switch);
			memset(recv2, 0, UART2_RX_LENGTH);
			//----------------------------------------

			HAL_UART_Transmit(&huart2, "at+upsda=0,3", sizeof("at+upsda=0,3")-1, 30);
			HAL_UART_Transmit(&huart2, "\r", 1, 30);

			if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
			{
				//Error_Handler();
			}
			osDelay(UART2_ATCMD_DELAY);
			HAL_UART_Abort_IT(&huart2);

			print_atCommand(recv2, uart2_msg_print_switch);
			memset(recv2, 0, UART2_RX_LENGTH);
		}



		//----------------------------------------

		//print_atCommand(recv2, uart2_msg_print_switch);


#if 0
		if((u2_states = HAL_UART_Receive(&huart2, (uint8_t*)&recv2, 1, UART3_TIMEOUT)) == HAL_OK){
			HAL_UART_Transmit(&huart2, (uint8_t*)&recv2, 1, UART3_TIMEOUT);
		}
		else if (u2_states == HAL_TIMEOUT){
			HAL_UART_Abort(&huart2);
		}
#endif
		osDelay(UART2_TASK_ENTRY_TIME);
    }
  /* USER CODE END usart2_entry */
}

/* usart3_entry function */
void usart3_entry(void const * argument)
{
  /* USER CODE BEGIN usart3_entry */
	uint8_t recv3[4] = {0};
	int temp;
	uint8_t *cml_head, *cml_limit, *cml_ptr = cml_array;
	HAL_StatusTypeDef u3_states = HAL_OK;
	cml_head = cml_limit = cml_ptr;
	uint8_t cnt = 0;
	/* Infinite loop */
	for(;;)
	{
#if (0)
		//recv3[0] = recv3[1] = recv3[2] = 0;
		osMutexWait(MUTEX_DebugHandle, osWaitForever);
		if(HAL_UART_Receive(&huart3, (uint8_t*)&recv3[0], 1, 1) == HAL_OK){
			if (HAL_UART_Receive(&huart3, (uint8_t*)&recv3[1], 1, 1) != HAL_OK){
				switch(recv3[0]){
					case '\0':
						break;
					//-----------------------------------------------------
					case '\r':
					case '\n':
						HAL_UART_Transmit(&huart3, SVA_1000_NL, sizeof(SVA_1000_NL) - 1, sizeof(SVA_1000_NL) - 1);
						*cml_limit = '\0';
						osMutexWait(MUTEX_CMD_PROCHandle, osWaitForever);
						memcpy(cml_proc, cml_array, (uint32_t)(cml_limit - cml_head + 1));
						osMutexRelease(MUTEX_CMD_PROCHandle);
						cml_ptr = cml_limit = cml_head;

						break;

					//-----------------------------------------------------
					/* Delete Key. */
					case 0x7E:

						break;
					//-----------------------------------------------------
					case 0x7F:
						recv3[0] = '\b';

					case '\b':
						if ((cml_ptr > cml_head) && (cml_limit > cml_head)){
							temp = cml_limit - cml_ptr;
							*(--cml_ptr) = 0;
							strncpy(cml_ptr, (cml_ptr + 1), temp);
							HAL_UART_Transmit(&huart3, (uint8_t*)&recv3[0], 1, 1);
							HAL_UART_Transmit(&huart3, cml_ptr, temp, temp);
							HAL_UART_Transmit(&huart3, " ", 1, 1);
							//HAL_UART_Transmit(&huart3, (uint8_t*)&recv3[0], 1, UART3_TIMEOUT);


