sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
		  	//Read
		  	HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_RESET);
		  	HAL_SPI_Transmit(&hspi1, (uint8_t*)aTxBuffer3, sizeof(aTxBuffer3), 5000);

		  	HAL_SPI_Receive(&hspi1, (uint8_t*)flash_RxBuffer, sizeof(flash_RxBuffer), 10000);
		  	HAL_GPIO_WritePin(SPI1_CS_GPIO_Port, SPI1_CS_Pin, GPIO_PIN_SET);


		    flag_flashWrite = 0;
	  }

	  osDelay(SPI1_TASK_ENTRY_TIME);
  }
  /* USER CODE END spi1_entry */
}

/* can_entry function */
void can_entry(void const * argument)
{
  /* USER CODE BEGIN can_entry */
	//uint8_t canTx[8] = {0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07};
	uint8_t ubKeyNumber = 0x0;
	CAN_FilterConfTypeDef  sFilterConfig;
	CanTxMsgTypeDef  TxMessage;
 	CanRxMsgTypeDef  RxMessage;

 	hcan.pTxMsg = &TxMessage;
 	hcan.pRxMsg = &RxMessage;


 	/*##-2- Configure the CAN Filter ###########################################*/
	  sFilterConfig.FilterNumber = 0;
	  sFilterConfig.FilterMode = CAN_FILTERMODE_IDMASK;
	  sFilterConfig.FilterScale = CAN_FILTERSCALE_32BIT;
	  sFilterConfig.FilterIdHigh = 0x0000;
	  sFilterConfig.FilterIdLow = 0x0000;
	  sFilterConfig.FilterMaskIdHigh = 0x0000;
	  sFilterConfig.FilterMaskIdLow = 0x0000;
	  sFilterConfig.FilterFIFOAssignment = 0;
	  sFilterConfig.FilterActivation = ENABLE;
	  sFilterConfig.BankNumber = 14;

	  if (HAL_CAN_ConfigFilter(&hcan, &sFilterConfig) != HAL_OK)
	  {
		/* Filter configuration Error */
		Error_Handler();
	  }

	  /*##-3- Configure Transmission process #####################################*/
	  hcan.pTxMsg->StdId = 0x321;
	  hcan.pTxMsg->ExtId = 0x01;
	  hcan.pTxMsg->RTR = CAN_RTR_DATA;
	  hcan.pTxMsg->IDE = CAN_ID_STD;
	  hcan.pTxMsg->DLC = 4;

	  //hcan.pTxMsg->Data[0] = 0xA5;
	  //hcan.pTxMsg->Data[1] = 0x63;


  /* Infinite loop */
  for(;;)
  {
	  /*##-2- Start the Reception process and enable reception interrupt #########*/
		if (HAL_CAN_Receive_IT(&hcan, CAN_FIFO0) != HAL_OK)
		{
			/* Reception Error */
			Error_Handler();
		}

	  /* Set the data to be transmitted */
			ubKeyNumber++;
			hcan.pTxMsg->Data[0] = ubKeyNumber;
			hcan.pTxMsg->Data[1] = 0x55;
			hcan.pTxMsg->Data[2] = 0xaa;
			hcan.pTxMsg->Data[3] = 0xaa;

	  /*##-3- Start the Transmission process ###############################*/
	  if (HAL_CAN_Transmit(&hcan, 10) != HAL_OK)
	  {
		/* Transmission Error */
		Error_Handler();
	  }

	  //HAL_CAN_Transmit_IT(&hcan);
	  //HAL_CAN_Receive(&hcan,  CAN_FIFO0, 1000);
	  osDelay(CAN_TASK_ENTRY_TIME);
  }
  /* USER CODE END can_entry */
}

/* USER CODE BEGIN Application */
#if (AEWIN_DBUG)
void aewin_dbg(char *fmt,...){
	osMutexWait(MUTEX_DebugHandle, osWaitForever);
	int i = 0;
	static va_list arg_ptr;
	va_start (arg_ptr, fmt);
	vsnprintf(dbg_buff, PRINT_BUFF, fmt, arg_ptr);
	while(i < (PRINT_BUFF - 1) && dbg_buff[i]){
		if (HAL_UART_Transmit_DMA(&huart3, (uint8_t*)&dbg_buff[i], 1) == HAL_OK){
			i++;
		}
	}
	va_end(arg_ptr);
	osMutexRelease(MUTEX_DebugHandle);
}
#endif

void HAL_RTC_AlarmAEventCallback(RTC_HandleTypeDef *handleRTC)
{
    // RTC wakeup
	if(current_IgEvent[NUM_alarm_status] == 1)
	{
		HAL_GPIO_WritePin(GPIOC, TEST_4G_Pin, GPIO_PIN_RESET);
		HAL_Delay(1);
		HAL_GPIO_WritePin(GPIOC, TEST_4G_Pin, GPIO_PIN_SET);
	}
}



uint8_t adc_voltageConversion_int(uint32_t adc_value)
{
	// (((adc_24v & 0xfffU) * 330) / 409600) * 117 / 10
	//return ((((adc_value & 0xfffU) * 330) ) * 11700) / 1000 / 409600;
	return ((((adc_value & 0xfffU) * 330) ) * 117) / 1000 / 4096;
}

uint8_t adc_voltageConversion_float(uint32_t adc_value)
{
	// (((((adc_24v & 0xfffU) * 330) / 409600) * 117 / 10  * 100)% 100)
	return (((((adc_value & 0xfffU) * 330) ) * 11700) / 10 / 409600) % 100;
}

uint8_t adc_tempConversion_int(uint32_t adc_value)
{
	uint16_t mcu_adc, r_adc;
	double temp;
	mcu_adc = (((adc_value & 0xfffU) * 330) / 409600);

	// R = (10*MCU_ADC) / (3.3-MCU_ADC)
	r_adc = (100 * mcu_adc)/(33 - 10*mcu_adc);

	//r_adc = 10*(adc_value & 0xfffU)/(4096-(adc_value & 0xfffU))


	// 1/( log(r_adc/THERMISTOR_R25)/THERMISTOR_B_CONSTANT+1/(298.13) ) -273.13??;
	//return (100/( log(r_adc/THERMISTOR_R25)/THERMISTOR_B_CONSTANT + 100/(29813) ) -27313)/100;
	//return ((-1379)*(1*r_adc-10)+25000)/1000;
	return (158883840-26379*(adc_value & 0xfffU))/4096000;
}

uint8_t adc_tempConversion_float(uint32_t adc_value)
{
	uint16_t mcu_adc, r_adc, temp;
	mcu_adc = (((adc_value & 0xfffU) * 330) / 409600);

	// R = (10*MCU_ADC) / (3.3-MCU_ADC)
	r_adc = (100 * mcu_adc)/(33 - 10*mcu_adc);

	// 1/( log(r_adc/THERMISTOR_R25)/THERMISTOR_B_CONSTANT+1/(298.13) ) -273.13??;
	//return (100/( log(r_adc/THERMISTOR_R25)/THERMISTOR_B_CONSTANT+100/(29813) ) -27313) %100;
	//return (((-1379)*(1*r_adc-10)+25000)/10) % 100;
	return ((158883840-26379*(adc_value & 0xfffU))/40960)%100;
}





uint8_t uart_findDataIndex(uint8_t uart_msg[], uint8_t target_data)
{
	// target data is the target_comma
	// first data is regard as 0th comma

	uint16_t index, split_count;
	// find index
	split_count = 0;
	for(index = 0; index<UART2_RX_LENGTH; index++)
	{
		if(target_data == 1)
		{
			if(uart_msg[index] == ':')
			{
				return (index+2);
			}
		}
		else
		{
			if(uart_msg[index] == ',')
			{
				split_count++;
			}

			if(split_count == (target_data-1))
			{
				return (index+1);
			}
		}
	}
	return 0; //not found
}

uint8_t uart2_isFindString(uint8_t uart_msg[], uint8_t target_string[], uint8_t length)
{
	uint16_t index, string_index, flag_find = 0;
	for(index = 0; index<UART2_RX_LENGTH; index++)
	{
		if(uart_msg[index] == target_string[0])
		{
			for(string_index = 1; string_index < length; string_index++)
			{
				if(uart_msg[index + string_index] != target_string[string_index])
				{
					flag_find = 0;
					break;
				}
				else
				{
					flag_find = 1;
				}
			}
			//break;
		}
	}
	return flag_find;
}

void enable_4GModule(void)
{
	//A1
	HAL_GPIO_WritePin(ENABLE_4G_GPIO_Port, ENABLE_4G_Pin, GPIO_PIN_RESET);
	HAL_Delay(1);
	HAL_GPIO_WritePin(ENABLE_4G_GPIO_Port, ENABLE_4G_Pin, GPIO_PIN_SET);

	//A0
	HAL_GPIO_WritePin(GPIOC, TEST_4G_Pin, GPIO_PIN_RESET);
	HAL_Delay(1);
	HAL_GPIO_WritePin(GPIOC, TEST_4G_Pin, GPIO_PIN_SET);
}

