sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
void print_atCommand(uint8_t rx_msg[], uint8_t onOff)
{
	int i;
	if(onOff == 1)
	{
		aewin_dbg("=====AT command=====\r\n");
		for(i=0;i<UART2_RX_LENGTH;i++)
		{
			aewin_dbg("%c",rx_msg[i]);
		}
		aewin_dbg("---------------------\r\n");
	}
}

uint8_t check_lowPower(uint32_t adc_value)
{
	uint8_t low_std = 9*10 + current_IgEvent[NUM_12V_shutdown]*5;
	//low_std = current_IgEvent[NUM_in_volt_min]*10;
	uint8_t current_voltage = (adc_voltageConversion_int(adc_value)*10 + (adc_voltageConversion_float(adc_value)/10) );

	if( current_voltage < low_std)
	{
		//aewin_dbg("Current Voltage %d V is lower than shutdown power setting %d V.\r\n", current_voltage, low_std);
		return 1;
	}
	else
	{
		//aewin_dbg("Current Voltage %d V is higher than shutdown power setting %d V.\r\n", current_voltage, low_std);
		return 0;
	}
}

uint8_t check_highPower(uint32_t adc_value)
{
	uint8_t high_std = 10*10 + current_IgEvent[NUM_12V_startup]*5;
	uint8_t current_voltage = (adc_voltageConversion_int(adc_value)*10 + (adc_voltageConversion_float(adc_value)/10) );

	if( current_voltage > high_std)
	{
		//aewin_dbg("\r\nCurrent Voltage %d V is higher than startup power setting %d V.\r\n", current_voltage, high_std);
		return 1;
	}
	else
	{
		//aewin_dbg("\r\nCurrent Voltage %d V is lower than startup power setting %d V.\r\n", current_voltage, high_std);
		return 0;
	}
}

void config_recovery(void)
{
	uint8_t data_index;

	for(data_index = 0; data_index<NUM_total;data_index++)
	{
		current_IgEvent[data_index] = flash_IgEvent[data_index];
	}

}

/* USER CODE END Application */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
